# KeyBasedTreeEntry Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntry Class
Members See Also
---
A key-based tree entry, containing the key, parent key, and children keys (if applicable).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class KeyBasedTreeEntry : IDisposable
```

Visual Basic
---
```text
Public Class KeyBasedTreeEntry _
	Implements IDisposable
```

Visual C++
---
```text
public ref class KeyBasedTreeEntry : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..KeyBasedTreeEntry Autodesk.Revit.DB..::..ClassificationEntry Autodesk.Revit.DB..::..KeynoteEntry
# See Also
KeyBasedTreeEntry Members
Autodesk.Revit.DB Namespace